{"title": "The Role of Team Cognition In Collaborative Information Seeking During Team Decision-Making", "author": "@b[{Nathaniel James Mcneese@c}]@b", "URL": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=G1CnZ38AAAAJ&cstart=100&pagesize=100&sortby=pubdate&citation_for_view=G1CnZ38AAAAJ:ldfaerwXgEUC", "abstract": "OBJECTIVE: Team decision-making is a process composed of many activities. One important activity is collaborative information seeking (CIS). CIS takes place when “two or more individuals work together to seek needed information in order to satisfy a goal”(Karunakaran &amp; Reddy, 2012). Consequently, CIS can play an important role in team decision-making. Current CIS research has focused on (1) examining the social and interactional aspects of CIS in organizational and other settings and (2) developing technical approaches to support CIS activities. However, most CIS research has overlooked the cognitive aspects of CIS. In particular, there is little research examining CIS from a team cognitive perspective. Often, the development of team cognition positively improves the team decision-making process (Cooke et al., 2003). Specifically, the development of team mental models, a team cognitive construct, has often been identified as a way to help teams complete their work (Lim &amp; Klein, 2006). However, the relationship of CIS and team cognition has never fully been explored. In this dissertation, my four main research objectives were to (a) explore how teams approach CIS;(b) develop a conceptual understanding of team cognition during CIS;(c) understand the impact and affect of a co-located and distributed setting on team’s CIS approaches and the development of team cognition, and (d) develop design guidelines for information technologies that will support multiple CIS approaches and the development of team cognition during CIS. To meet my research objectives, I conducted two separate qualitative laboratory studies of undergraduate student teams …", "issued": "@ignore@"}